Revit 2027 API
ExternalService.VendorId Property
 The vendor who provided the service
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string VendorId { get; }
Public ReadOnly Property VendorId As String
	Get
public:
property String^ VendorId {
	String^ get ();
}
member VendorId : string with get
Property Value
String
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace